In [85]:
# importing libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [86]:
# import dataset
df = pd.read_csv('homework_data.csv')
print(df)

  Animal   Age    Worth Friendly
0    Cat   NaN  72000.0       No
1    Dog  17.0      NaN      Yes
2  Moose   6.0  54000.0       No
3    NaN   8.0  61000.0       No
4  Moose   4.0      NaN      Yes
5    Cat  15.0  58000.0      Yes
6    Dog   NaN  52000.0       No
7    Cat  12.0      NaN      Yes
8  Moose   NaN  83000.0       No
9    Cat   7.0  67000.0      Yes

In [87]:
#delete duplicate
df = df.drop_duplicates()
df = df.reset_index(drop = True)
df

  Animal   Age    Worth Friendly
0    Cat   NaN  72000.0       No
1    Dog  17.0      NaN      Yes
2  Moose   6.0  54000.0       No
3    NaN   8.0  61000.0       No
4  Moose   4.0      NaN      Yes
5    Cat  15.0  58000.0      Yes
6    Dog   NaN  52000.0       No
7    Cat  12.0      NaN      Yes
8  Moose   NaN  83000.0       No
9    Cat   7.0  67000.0      Yes

In [88]:
#check data
from collections import Counter
print(Counter(df['Animal']))
print(Counter(df['Friendly']))

Counter({'Cat': 4, 'Moose': 3, 'Dog': 2, nan: 1})
Counter({'No': 5, 'Yes': 5})

In [89]:
#check data
df.describe()

             Age         Worth
count   7.000000      7.000000
mean    9.857143  63857.142857
std     4.879500  10976.164652
min     4.000000  52000.000000
25%     6.500000  56000.000000
50%     8.000000  61000.000000
75%    13.500000  69500.000000
max    17.000000  83000.000000

In [90]:
# Melihat kolom yang memiliki missing value
df[df.isnull().any(axis = 1)]

  Animal   Age    Worth Friendly
0    Cat   NaN  72000.0       No
1    Dog  17.0      NaN      Yes
3    NaN   8.0  61000.0       No
4  Moose   4.0      NaN      Yes
6    Dog   NaN  52000.0       No
7    Cat  12.0      NaN      Yes
8  Moose   NaN  83000.0       No

In [92]:
#fill animal value with mode
df["Animal"] = df["Animal"].fillna(df["Animal"].mode()[0])
df

  Animal   Age    Worth Friendly
0    Cat   NaN  72000.0       No
1    Dog  17.0      NaN      Yes
2  Moose   6.0  54000.0       No
3    Cat   8.0  61000.0       No
4  Moose   4.0      NaN      Yes
5    Cat  15.0  58000.0      Yes
6    Dog   NaN  52000.0       No
7    Cat  12.0      NaN      Yes
8  Moose   NaN  83000.0       No
9    Cat   7.0  67000.0      Yes

In [93]:
#fill age with mean of animal category
for x in df.explode('Animal')['Animal'].unique():
  df['Age'][df['Animal']== x ]=df['Age'][df['Animal']== x ].fillna(df['Age'][df["Animal"] == x].mean())

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [95]:
#fill worth with mean of animal category
for x in df.explode('Animal')['Animal'].unique():
  df['Worth'][df['Animal']== x ]=df['Worth'][df['Animal']== x ].fillna(df['Worth'][df["Animal"] == x].mean())

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [97]:
#check null data
df.isnull().sum()

Animal      0
Age         0
Worth       0
Friendly    0
dtype: int64

In [96]:
#final data
df

  Animal   Age    Worth Friendly
0    Cat  10.5  72000.0       No
1    Dog  17.0  52000.0      Yes
2  Moose   6.0  54000.0       No
3    Cat   8.0  61000.0       No
4  Moose   4.0  68500.0      Yes
5    Cat  15.0  58000.0      Yes
6    Dog  17.0  52000.0       No
7    Cat  12.0  64500.0      Yes
8  Moose   5.0  83000.0       No
9    Cat   7.0  67000.0      Yes